import assets from "./assets";

const NFTData = [
  {
    id: "NFT-01",
    name: "디지털 배경",
    creator: "Korea",
    price: 5.25,
    description:
      "NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.",
    image: assets.nft01,
    bids: [
      {
        id: "BID-11",
        name: "홍길동",
        price: 4.25,
        image: assets.person02,
        date: "2022년 12월 6일 오후 12:20",
      },
      {
        id: "BID-12",
        name: "박순자",
        price: 4.8,
        image: assets.person03,
        date: "2022년 12월 7일 오후 14:20",
      },
      {
        id: "BID-13",
        name: "이영희",
        price: 4.89,
        image: assets.person04,
        date: "2022년 12월 7일 오후 18:15",
      },
    ],
  },
  {
    id: "NFT-02",
    name: "고슴도치",
    creator: "고릴라",
    price: 7.25,
    description:
      "NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.",
    image: assets.nft02,
    bids: [
      {
        id: "BID-21",
        name: "강문길",
        price: 7.05,
        image: assets.person05,
        date: "2022년 12월 10일 오전 06:15",
      },
    ],
  },
  {
    id: "NFT-03",
    name: "동굴속에사람",
    creator: "태양",
    price: 95.25,
    description:
      "NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.",
    image: assets.nft03,
    bids: [
      {
        id: "BID-31",
        name: "이지선",
        price: 95.25,
        image: assets.person06,
        date: "2022년 12월 7일 오후 14:15",
      },
      {
        id: "BID-32",
        name: "최순자",
        price: 95.5,
        image: assets.person05,
        date: "2022년 12월 7일 오후 18:20",
      },
    ],
  },
  {
    id: "NFT-04",
    name: "오두막집",
    creator: "소녀",
    price: 54.25,
    description:
      "NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.",
    image: assets.nft04,
    bids: [
      {
        id: "BID-41",
        name: "김순자",
        price: 56.25,
        image: assets.person01,
        date: "2022년 12월 10일 오후 13:10",
      },
      {
        id: "BID-42",
        name: "김희라",
        price: 54.25,
        image: assets.person05,
        date: "2022년 12월 10일 오후 14:15",
      },
      {
        id: "BID-43",
        name: "이기영",
        price: 55.15,
        image: assets.person06,
        date: "2022년 12월 10일 오후 18:17",
      },
      {
        id: "BID-44",
        name: "강나래",
        price: 54.15,
        image: assets.person02,
        date: "2022년 12월 10일 오후 18:25",
      },
    ],
  },
  {
    id: "NFT-05",
    name: "집안",
    creator: "시녀",
    price: 10.25,
    description:
      "NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.",
    image: assets.nft05,
    bids: [
      {
        id: "BID-51",
        name: "이미지",
        price: 10.25,
        image: assets.person02,
        date: "2022년 12월 8일 오후 15:15",
      },
    ],
  },
  {
    id: "NFT-06",
    name: "박쥐",
    creator: "드라큘라",
    price: 20.25,
    description:
      "NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.",
    image: assets.nft06,
    bids: [
      {
        id: "BID-61",
        name: "이자연",
        price: 20.25,
        image: assets.person02,
        date: "2022년 12월 7일 오후 18:15",
      },
      {
        id: "BID-62",
        name: "박효리",
        price: 20.5,
        image: assets.person03,
        date: "2022년 12월 7일 오후 19:25",
      },
      {
        id: "BID-63",
        name: "최연희",
        price: 20.75,
        image: assets.person04,
        date: "2022년 12월 7일 오후 21:15",
      },
      {
        id: "BID-64",
        name: "강호자",
        price: 21.25,
        image: assets.person05,
        date: "2022년 12월 7일 오후 22:25",
      },
      {
        id: "BID-65",
        name: "박지선",
        price: 7.25,
        image: assets.person06,
        date: "2022년 12월 8일 오후 18:15",
      },
    ],
  },
  {
    id: "NFT-07",
    name: "얼굴없는 사람",
    creator: "신의손",
    price: 18.25,
    description:
      "NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.NFT 상점애 등록된 이미지 입니다. 환성적인 이미지 경매에 참여하세요.",
    image: assets.nft07,
    bids: [],
  },
];

export { NFTData };
